# 给一个不多于5位的正整数，要求：一、求它是几位数，二、逆序打印出各位数字。
'''
表达式	含义	结果
a = x // 10000	提取万位	5
b = x % 10000 // 1000	提取千位	4
c = x % 1000 // 100	提取百位	3
d = x % 100 // 10	提取十位	2
e = x % 10	提取个位	1
'''

#!/usr/bin/python

#分解每一位数:
x = int(input("请输入一个不多1于五位数的正整数：\n"))
a = x //10000
b = x % 10000 // 1000
c = x % 1000 // 100
d = x % 100 // 10
e = x % 10

if a != 0:
    print("5 位数：", e, d, c, b, a)
elif b != 0:
    print("4 位数：", e, d, c, b)
elif c != 0:
    print("3 位数：", e, d, c)
elif d != 0:
    print("2 位数：", e, d)
else:
    print("1 位数：", e)